doc/SAMPLE_REQUEST_XML/Get Installed Applications from machines where Operating System contains Mac.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <session>1-3042-f5f1a43fba43de4e267104fa59665d39587a3410da642212dc7f92d9349a8cbc5f48e48d03b8dfd896dd4c860b713a294afad1197aea7f5268d3f629fb6ff987</session>
      <command>AddObject</command>
      <object_list>
        <question>
          <id>-1</id>
          <selects>
            <select>
              <sensor>
                <hash>1511329504</hash>
                <source_id>0</source_id>
                <max_age_seconds>0</max_age_seconds>
                <ignore_case_flag>0</ignore_case_flag>
                <exclude_from_parse_flag>0</exclude_from_parse_flag>
                <preview_sensor_flag>0</preview_sensor_flag>
                <hidden_flag>0</hidden_flag>
                <cache_row_id>0</cache_row_id>
              </sensor>
              <filter>
                <id>-1</id>
                <sensor>
                  <hash>1511329504</hash>
                  <source_id>0</source_id>
                  <max_age_seconds>0</max_age_seconds>
                  <ignore_case_flag>0</ignore_case_flag>
                  <exclude_from_parse_flag>0</exclude_from_parse_flag>
                  <preview_sensor_flag>0</preview_sensor_flag>
                  <hidden_flag>0</hidden_flag>
                  <cache_row_id>0</cache_row_id>
                </sensor>
                <operator>Less</operator>
                <value_type>String</value_type>
                <value></value>
                <not_flag>0</not_flag>
                <max_age_seconds>0</max_age_seconds>
                <ignore_case_flag>1</ignore_case_flag>
                <all_values_flag>0</all_values_flag>
                <substring_flag>0</substring_flag>
                <substring_start>0</substring_start>
                <substring_length>0</substring_length>
                <delimiter></delimiter>
                <delimiter_index>0</delimiter_index>
                <utf8_flag>0</utf8_flag>
                <aggregation>Sum</aggregation>
                <all_times_flag>0</all_times_flag>
                <start_time></start_time>
                <end_time></end_time>
              </filter>
            </select>
          </selects>
          <context_group>
            <id>0</id>
            <and_flag>0</and_flag>
            <not_flag>0</not_flag>
            <deleted_flag>0</deleted_flag>
          </context_group>
          <group>
            <id>-1</id>
            <name></name>
            <and_flag>1</and_flag>
            <not_flag>0</not_flag>
            <sub_groups/>
            <filters>
              <filter>
                <id>-1</id>
                <sensor>
                  <hash>45421433</hash>
                  <source_id>0</source_id>
                  <max_age_seconds>0</max_age_seconds>
                  <ignore_case_flag>0</ignore_case_flag>
                  <exclude_from_parse_flag>0</exclude_from_parse_flag>
                  <preview_sensor_flag>0</preview_sensor_flag>
                  <hidden_flag>0</hidden_flag>
                  <cache_row_id>0</cache_row_id>
                </sensor>
                <operator>RegexMatch</operator>
                <value>.*Mac.*</value>
                <not_flag>0</not_flag>
                <max_age_seconds>0</max_age_seconds>
                <ignore_case_flag>1</ignore_case_flag>
                <all_values_flag>0</all_values_flag>
                <substring_flag>0</substring_flag>
                <substring_start>0</substring_start>
                <substring_length>0</substring_length>
                <delimiter></delimiter>
                <delimiter_index>0</delimiter_index>
                <utf8_flag>0</utf8_flag>
                <aggregation>Sum</aggregation>
                <all_times_flag>0</all_times_flag>
                <start_time></start_time>
                <end_time></end_time>
              </filter>
            </filters>
            <deleted_flag>0</deleted_flag>
          </group>
          <expire_seconds>600</expire_seconds>
          <skip_lock_flag>0</skip_lock_flag>
          <hidden_flag>0</hidden_flag>
          <action_tracking_flag>0</action_tracking_flag>
          <force_computer_id_flag>0</force_computer_id_flag>
          <cache_row_id>0</cache_row_id>
          <index>0</index>
        </question>
      </object_list>
      <options>
        <flags>0</flags>
        <hide_errors_flag>1</hide_errors_flag>
        <include_answer_times_flag>0</include_answer_times_flag>
        <row_counts_only_flag>0</row_counts_only_flag>
        <aggregate_over_time_flag>0</aggregate_over_time_flag>
        <most_recent_flag>0</most_recent_flag>
        <include_hashes_flag>0</include_hashes_flag>
        <hide_no_results_flag>0</hide_no_results_flag>
        <use_user_context_flag>0</use_user_context_flag>
        <return_lists_flag>0</return_lists_flag>
        <return_cdata_flag>0</return_cdata_flag>
        <pct_done_limit>99</pct_done_limit>
        <context_id>0</context_id>
        <sample_frequency>0</sample_frequency>
        <sample_start>0</sample_start>
        <sample_count>0</sample_count>
        <suppress_scripts>0</suppress_scripts>
        <row_start>0</row_start>
        <row_count>-1</row_count>
        <sort_order></sort_order>
        <filter_string></filter_string>
        <filter_not_flag>0</filter_not_flag>
        <cache_expiration>0</cache_expiration>
        <include_user_details>1</include_user_details>
        <include_hidden_flag>0</include_hidden_flag>
      </options>
      <ID>0</ID>
      <ContextID>0</ContextID>
      <Flags>0</Flags>
      <PctDoneLimit>0</PctDoneLimit>
      <SampleFrequency>0</SampleFrequency>
      <SampleStart>0</SampleStart>
      <SampleCount>0</SampleCount>
      <RowStart>0</RowStart>
      <RowCount>0</RowCount>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
